app/views/caterers/index.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."caterer_id" = ? LIMIT ?  [["caterer_id", 9], ["LIMIT", 1]]
---
								<td><%= truncate(caterer.description) %></td>
								<% if caterer.address.location.empty? %>