app/views/caterers/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."caterer_id" = ?  [["caterer_id", 7]]
---
		<div class="app-gallery clearfix">
			<% @caterer.images.each do |image| %>