app/views/dashboard/decorator.html.erb

									<td><%= truncate(decorator.description) %></td>
									<% if decorator.address.location.empty? %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."decorator_id" = ? LIMIT ?  [["decorator_id", 1], ["LIMIT", 1]]