app/views/dashboard/profile.html.erb

SELECT COUNT(*) FROM "venues" WHERE "venues"."user_id" = ?  [["user_id", 3]]
---
					<div class="width-100 text-center pull-right hidden-md-down">
						<h2><%= @user.venues.count %></h2>

SELECT COUNT(*) FROM "caterers" WHERE "caterers"."user_id" = ?  [["user_id", 3]]
---
					<div class="width-100 text-center pull-right hidden-md-down">
						<h2><%= @user.caterers.count %></h2>

SELECT COUNT(*) FROM "planners" WHERE "planners"."user_id" = ?  [["user_id", 3]]
---
					<div class="width-100 text-center pull-right hidden-md-down">
						<h2><%= @user.planners.count %></h2>