app/views/decorators/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."decorator_id" = ?  [["decorator_id", 1]]
---
						<div class="app-gallery clearfix">
							<% @decorator.images.each do |image| %>