app/views/planners/index.html.erb

								</td>
								<% if planner.address.location.empty? %>
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."planner_id" = ? LIMIT ?  [["planner_id", 2], ["LIMIT", 1]]