app/views/planners/show.html.erb

						<div class="app-gallery clearfix">
							<% @planner.images.each do |image| %>
---
SELECT "images".* FROM "images" WHERE "images"."planner_id" = ?  [["planner_id", 3]]