app/views/venues/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."venue_id" = ?  [["venue_id", 11]]
---
			<div class="app-gallery clearfix">
				<% @venue.images.each do |image| %>