app/controllers/caterers_controller.rb

	def index
		@caterers = Caterer.all
---
SELECT "caterers".* FROM "caterers"

      def create
      	@caterer = Caterer.new(caterer_params)
      	@caterer.user_id = current_user.id
      	if @caterer.save
---
INSERT INTO "caterers" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Kirit Katerers"], ["description", "Best Food in town, aap ayya, ham dilayya"], ["created_at", 2016-08-06 07:22:01 UTC], ["updated_at", 2016-08-06 07:22:01 UTC], ["user_id", 1]]

      def show
      	@caterer = Caterer.find(params[:id])
---
SELECT  "caterers".* FROM "caterers" WHERE "caterers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      def destroy
      	@caterer = Caterer.find(params[:id])
      	if @caterer.destroy
---
SELECT  "caterers".* FROM "caterers" WHERE "caterers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "caterers" WHERE "caterers"."id" = ?  [["id", 1]]

      def edit
      	@caterer = Caterer.find(params[:id])
---
SELECT  "caterers".* FROM "caterers" WHERE "caterers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

      def update
      	@caterer = Caterer.find(params[:id])
---
SELECT  "caterers".* FROM "caterers" WHERE "caterers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]