app/controllers/dashboard_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def profile
		@user = User.find(params[:id])

SELECT "users".* FROM "users"
---
	def all_users
		@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "paid" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["paid", false], ["updated_at", 2016-09-08 10:27:17 UTC], ["id", 2]]
---
	def block_user
		@user = User.find(params[:id])
		if @user.paid?
			@user.paid = false
		else
			@user.paid = true
		end
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
	def destroy
		@user = User.find(params[:id])

		if @user.destroy