app/controllers/decorators_controller.rb

INSERT INTO "decorators" ("title", "description", "created_at", "updated_at", "user_id", "terms") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@decorators = Decorator.new(decorators_params)
		@decorators.user_id = current_user.id

		if @decorators.save

SELECT  "decorators".* FROM "decorators" WHERE "decorators"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@decorator = Decorator.find(params[:id])