app/controllers/planners_controller.rb

	def index
		@planners = Planner.all
---
SELECT "planners".* FROM "planners"

      def create
      	@planners = Planner.new(planners_params)
      	@planners.user_id = current_user.id
      	if @planners.save
---
INSERT INTO "planners" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Valindo"], ["description", "Valindo"], ["created_at", 2016-08-06 10:58:10 UTC], ["updated_at", 2016-08-06 10:58:10 UTC], ["user_id", 1]]

      def show
      	@planner = Planner.find(params[:id])
---
SELECT  "planners".* FROM "planners" WHERE "planners"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

      def destroy
      	@planner = Planner.find(params[:id])
      	if @planner.destroy
---
SELECT  "planners".* FROM "planners" WHERE "planners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "planners" WHERE "planners"."id" = ?  [["id", 1]]

      def edit
      	@planners = Planner.find(params[:id])
---
SELECT  "planners".* FROM "planners" WHERE "planners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

      def update
      	@planners = Planner.find(params[:id])
      	if @planners.update(planners_params)
---
SELECT  "planners".* FROM "planners" WHERE "planners"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "planners" SET "description" = ?, "updated_at" = ? WHERE "planners"."id" = ?  [["description", "aya"], ["updated_at", 2016-08-06 11:03:19 UTC], ["id", 2]]