app/controllers/reviews_controller.rb

	def update
		@review = Review.find(params[:id])

		if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "reviews" SET "name" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["name", "Godinho"], ["updated_at", 2016-09-14 18:34:16 UTC], ["id", 6]]

	def create
		@review = Review.new(review_params)
		if @review.save
---
INSERT INTO "reviews" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", 2016-09-14 13:39:24 UTC], ["updated_at", 2016-09-14 13:39:24 UTC]]