app/controllers/venues_controller.rb

SELECT "venues".* FROM "venues"
---
	def index
		@venues = Venue.all

INSERT INTO "venues" ("title", "description", "created_at", "updated_at", "user_id", "terms", "venue_type") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Kalyani "], ["description", "Kalyani"], ["created_at", 2016-08-15 10:54:36 UTC], ["updated_at", 2016-08-15 10:54:36 UTC], ["user_id", 1], ["terms", "Home"], ["venue_type", "Open Air"]]
---
      def create
      	@venue = Venue.new(venue_params)
      	@venue.user_id = current_user.id
      	if @venue.save

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
      	@venue = Venue.find(params[:id])

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "venues" WHERE "venues"."id" = ?  [["id", 6]]
---
      def destroy
      	@venue = Venue.find(params[:id])
      	if @venue.destroy

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
      def edit
      	@venue = Venue.find(params[:id])

SELECT  "venues".* FROM "venues" WHERE "venues"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "venues" SET "venue_type" = ?, "updated_at" = ? WHERE "venues"."id" = ?  [["venue_type", "Close Air AC"], ["updated_at", 2016-08-15 10:56:10 UTC], ["id", 16]]
---
      def update
      	@venue = Venue.find(params[:id])

      	if @venue.update(venue_params)